<template>
  <div class="privacy-policy">
    <p class="text">Мы обязуемся защищать вашу конфиденциальность. В данной политике описывается, как мы собираем, используем и защищаем информацию, которую вы делитесь с нами в сервисе Gradeks. Используя наш сервис, вы соглашаетесь с условиями, изложенными ниже.</p>

    <h2 class="heading">1. Информация, которую мы собираем</h2>
    <p class="text">Для предоставления и улучшения нашего сервиса Gradeks собирает определенные данные из вашего электронного дневника. Это включает:</p>
    <ol>
      <li><strong>Идентификатор электронного дневника</strong>: Мы используем ваш уникальный идентификатор для получения официальных данных, связанных с вашими учебными записями.</li>
      <li><strong>Учебные данные</strong>: Собираются только данные, доступные через официальные каналы, такие как оценки, вес оценки, дата выставления оценки.</li>
    </ol>

    <h2 class="heading">2. Как мы используем вашу информацию</h2>
    <p class="text">Собранная информация используется исключительно для улучшения образовательного опыта и предоставления полезной аналитики. Это включает:</p>
    <ol>
      <li>Создание отчетов и аналитики на основе официальных данных</li>
      <li>Обеспечение безопасного опыта в сервисе Gradeks</li>
    </ol>

    <h2 class="heading">3. Защита и безопасность данных</h2>
    <p class="text">Мы реализуем надежные меры безопасности для защиты ваших данных, включая:</p>
    <ol>
      <li>Шифрование персональной информации</li>
      <li>Ограниченный доступ к персональным данным</li>
      <li>Регулярные аудиты для поддержания безопасности и целостности данных</li>
    </ol>

    <h2 class="heading">4. Ваши права на данные</h2>
    <p class="text">Вы имеете право:</p>
    <ol>
      <li>Получить доступ к данным, которые мы собираем о вас</li>
      <li>Запросить исправления, если данные неверны</li>
      <li>Запросить удаление ваших данных</li>
    </ol>

    <h2 class="heading">5. Свяжитесь с нами</h2>
    <p class="text">Если у вас есть вопросы или опасения по поводу данной Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу <NuxtLink to="https://t.me/gradeks_support_bot"><a class="support">t.me/gradeks_support_bot</a></NuxtLink></p>
  </div>
</template>

<style scoped>
.text {
  color: var(--theme-text-color-black);
}

.support {
  color: var(--theme-link-color);
  text-decoration: underline;
}

.support:visited {
  color: var(--theme-link-color);
}

.heading {
  margin: 20px 0 0 0;
  color: var(--theme-text-color-green);
  font-family: "PFEncoreSansPro-Black", serif;
  font-size: 20px;
  font-weight: 600;
  width: 100%;
  line-height: 26px;
}

.privacy-policy {
  font-family: Arial, sans-serif;
  line-height: 1.6;
  font-size: 15px;
}

h1, h2, ol {
  color: var(--theme-text-color-black);
}
</style>